{
  "movies": [
    {
      "id": "1",
      "title": "The Godfather",
      "duration": "2h 55m",
      "genre": "Drama, Crime",
      "poster": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/3bhkrj58Vtu7enYsRolD1fZdja1.jpg",
      "status": "on-screen",
      "description": "Directed by Francis Ford Coppola, 'The Godfather' is a masterful portrayal of the Corleone crime family's rise and fall in post-war America. Marlon Brando's iconic performance as Vito Corleone, the patriarch of the family, sets the stage for a gripping tale of loyalty, betrayal, and power. With its compelling storytelling and unforgettable characters, this film has become a timeless classic, influencing countless other works in the crime genre."
    },
    {
      "id": "2",
      "title": "The Godfather Part II",
      "duration": "3h 22m",
      "genre": "Drama, Crime",
      "poster": "https://m.media-amazon.com/images/M/MV5BMWMwMGQzZTItY2JlNC00OWZiLWIyMDctNDk2ZDQ2YjRjMWQ0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_FMjpg_UY2552_.jpg",
      "status": "on-screen",
      "description": "Building upon the legacy of its predecessor, 'The Godfather Part II' intertwines the past and present, showcasing Vito Corleone's ascent to power alongside his son Michael's struggle to maintain control of the family empire. Directed by Francis Ford Coppola, this sequel is a cinematic tour de force, earning widespread acclaim for its rich narrative depth, stunning performances, and intricate exploration of themes such as morality, ambition, and the American Dream."
    },
    {
      "id": "3",
      "title": "The Godfather Part III",
      "duration": "2h 44m",
      "genre": "Drama, Crime",
      "poster": "https://m.media-amazon.com/images/M/MV5BNWFlYWY2YjYtNjdhNi00MzVlLTg2MTMtMWExNzg4NmM5NmEzXkEyXkFqcGdeQXVyMDk5Mzc5MQ@@._V1_FMjpg_UY6000_.jpg",
      "status": "on-screen",
      "description": "Concluding the epic saga, 'The Godfather Part III' follows an aging Michael Corleone as he grapples with the consequences of his past decisions while navigating the treacherous world of international finance and organized crime. Directed by Francis Ford Coppola, this film delves into themes of redemption, legacy, and the corrupting influence of power, offering a poignant and fitting conclusion to one of cinema's greatest trilogies."
    },
    {
      "id": "4",
      "title": "The Mask",
      "duration": "1h 41m",
      "genre": "Comedy",
      "poster": "https://m.media-amazon.com/images/M/MV5BOWExYjI5MzktNTRhNi00Nzg2LThkZmQtYWVkYjRlYWI2MDQ4XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_FMjpg_UX1009_.jpg",
      "status": "on-screen",
      "description": "'The Mask' is a riotous comedy featuring Jim Carrey at the height of his comedic powers. As Stanley Ipkiss, a hapless bank clerk, Carrey discovers a mysterious mask that unleashes his wildest desires and transforms him into a zany, cartoonish superhero. Filled with outrageous humor, dazzling special effects, and memorable one-liners, this film is a rollicking adventure that showcases Carrey's unmatched talent for physical comedy."
    },
    {
      "id": "5",
      "title": "The Shawshank Redemption",
      "duration": "2h 22m",
      "genre": "Drama, Crime",
      "poster": "https://m.media-amazon.com/images/M/MV5BNDE3ODcxYzMtY2YzZC00NmNlLWJiNDMtZDViZWM2MzIxZDYwXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_FMjpg_UX1200_.jpg",
      "status": "on-screen",
      "description": "Based on a Stephen King novella, 'The Shawshank Redemption' is a stirring tale of hope and resilience in the face of adversity. Tim Robbins delivers a powerhouse performance as Andy Dufresne, a wrongfully convicted banker who finds solace and redemption through friendship with fellow inmate Ellis 'Red' Redding, portrayed by Morgan Freeman. Directed by Frank Darabont, this timeless classic is celebrated for its poignant storytelling, rich character development, and profound exploration of the human spirit."
    },
    {
      "id": "6",
      "title": "Forrest Gump",
      "duration": "2h 22m",
      "genre": "Comedy, Drama",
      "poster": "https://m.media-amazon.com/images/M/MV5BNWIwODRlZTUtY2U3ZS00Yzg1LWJhNzYtMmZiYmEyNmU1NjMzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_FMjpg_UX558_.jpg",
      "status": "on-screen",
      "description": "'Forrest Gump' is a cinematic journey through decades of American history, seen through the eyes of an unlikely hero. Tom Hanks delivers an unforgettable performance as Forrest Gump, a kind-hearted and intellectually challenged man whose remarkable life intersects with key historical events and influential figures. Directed by Robert Zemeckis, this heartwarming and whimsical film celebrates the power of love, perseverance, and the simple joys of life in the face of adversity."
    },
    {
      "id": "7",
      "title": "The Truman Show",
      "duration": "1h 43m",
      "genre": "Comedy, Drama",
      "poster": "https://m.media-amazon.com/images/M/MV5BMDIzODcyY2EtMmY2MC00ZWVlLTgwMzAtMjQwOWUyNmJjNTYyXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_FMjpg_UY2500_.jpg",
      "status": "coming-soon",
      "premiere": "June 5",
      "description": "'The Truman Show' is a thought-provoking satire that explores the boundaries of reality and the ethics of entertainment. Jim Carrey shines as Truman Burbank, a man unknowingly living in a meticulously constructed reality TV show. Directed by Peter Weir, this groundbreaking film raises profound questions about free will, surveillance, and the nature of authenticity in a media-saturated world, leaving audiences pondering the true meaning of freedom and identity."
    },
    {
      "id": "8",
      "title": "Inglourious Basterds",
      "duration": "2h 33m",
      "genre": "Drama, War",
      "poster": "https://m.media-amazon.com/images/M/MV5BOTJiNDEzOWYtMTVjOC00ZjlmLWE0NGMtZmE1OWVmZDQ2OWJhXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_FMjpg_UY3000_.jpg",
      "status": "coming-soon",
      "premiere": "August 21",
      "description": "Quentin Tarantino's 'Inglourious Basterds' is a stylish and audacious reimagining of World War II history. Led by Brad Pitt's charismatic performance as Lt. Aldo Raine, a band of Jewish-American soldiers embarks on a daring mission to assassinate Nazi leaders, including the infamous Adolf Hitler. Blending Tarantino's trademark dialogue, nonlinear storytelling, and explosive action, this film subverts expectations and delivers a thrilling, alternate reality where justice is served with a vengeance."
    },
    {
      "id": "9",
      "title": "The Age of Adaline",
      "duration": "1h 52m",
      "genre": "Fantasy, Romance, Drama",
      "poster": "https://m.media-amazon.com/images/M/MV5BMTAzMTQzMTA2MjheQTJeQWpwZ15BbWU4MDk2MTg2MzUx._V1_FMjpg_UY2048_.jpg",
      "status": "coming-soon",
      "premiere": "April 24",
      "description": "'The Age of Adaline' is a captivating romantic fantasy that transcends time and immortality. Blake Lively portrays Adaline Bowman, a woman who ceases to age after a mysterious accident, leading her on a solitary journey through the decades. As Adaline grapples with the bittersweet gift of eternal youth, she finds unexpected love and confronts the complexities of human connection. Directed by Lee Toland Krieger, this enchanting film weaves together themes of love, loss, and the enduring power of the human heart."
    }
  ],
  "schedules": [
    {
      "id": "1",
      "movieId": "1",
      "screenings": [
        {
          "id": "1",
          "time": "2024-04-09T14:00:00"
        },
        {
          "id": "2",
          "time": "2024-04-09T17:00:00"
        },
        {
          "id": "3",
          "time": "2024-04-10T17:00:00"
        },
        {
          "id": "4",
          "time": "2024-04-10T20:00:00"
        },
        {
          "id": "5",
          "time": "2024-04-11T16:00:00"
        },
        {
          "id": "6",
          "time": "2024-04-11T20:00:00"
        }
      ]
    },
    {
      "id": "2",
      "movieId": "2",
      "screenings": [
        {
          "id": "7",
          "time": "2024-04-09T18:00:00"
        },
        {
          "id": "8",
          "time": "2024-04-09T21:00:00"
        }
      ]
    },
    {
      "id": "3",
      "movieId": "3",
      "screenings": [
        {
          "id": "9",
          "time": "2024-04-09T18:00:00"
        },
        {
          "id": "10",
          "time": "2024-04-09T21:00:00"
        }
      ]
    },
    {
      "id": "4",
      "movieId": "4",
      "screenings": [
        {
          "id": "11",
          "time": "2024-04-09T12:00:00"
        },
        {
          "id": "12",
          "time": "2024-04-09T17:00:00"
        },
        {
          "id": "13",
          "time": "2024-04-10T20:00:00"
        }
      ]
    }
  ]
}
